AccumulationRegisters/ТоварыОтветственногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХранения</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХраненияПереданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОтветственногоХраненияПереданные</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОтветственногоХранения/Ext/ManagerModule.bsl
Функция ПолучитьДвиженияСписание(ДокОбъект) Экспорт	
	
	//+Шульман А. 21.06.2024 #UT10-4635
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	НаборДвижений = ДокОбъект.Движения.ТоварыОтветственногоХранения;	
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 
	ПромТаблицаДвижений = ТаблицаДвижений.Скопировать();
	ПромТаблицаДвижений.Очистить();
	
	ПолучитьТаблицуДвиженийСписания(ДокОбъект, ПромТаблицаДвижений);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ПромТаблицаДвижений, ТаблицаДвижений);
	НаборДвижений.мПериод          = ДокОбъект.Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;	
	
	Возврат ТаблицаДвижений;
	//-Шульман А. 21.06.2024 #UT10-4635
	
КонецФункции       

Процедура ПолучитьТаблицуДвиженийСписания(ДокОбъект, ПромТаблицаДвижений, 
	//+Шульман А. 31.07.2024 #UT10-4640   
	ТабЧастьТОХ = Неопределено
	//-Шульман А. 31.07.2024 #UT10-4640   
	) Экспорт
	
	// ВНИМАНИЕ!!! Меняя этот запрос, нужно также аналогичным образом изменить запрос 
	// в МСК.ТекстЗапросаЗаполнитьТЧТОХ() и УправлениеЗапасами.ПолучитьТаблицуСвободныхОстатковПоСериямТОХ()   
	
	//+Гавриленков В. 08.07.2026 #UT10-5949 Из полей выборки исключена Организация
	ЗапросОстатков = Новый Запрос;	  
	ЗапросОстатков.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросОстатков.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.СерияНоменклатуры,
	|	Товары.Количество
	|ПОМЕСТИТЬ ТаблТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	ТоварыОтветственногоХраненияОстатки.Организация,
	|	ТоварыОтветственногоХраненияОстатки.Контрагент,
	|	ТоварыОтветственногоХраненияОстатки.ДоговорКонтрагента,
	|	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	|	ТоварыОтветственногоХраненияОстатки.СерияНоменклатуры,
	|	ТоварыОтветственногоХраненияОстатки.КоличествоОстаток КАК КоличествоОстатокТОХ,
	|	0 КАК КоличествоОстатокТОХФилиал
	|ПОМЕСТИТЬ ВТ_ОстаткиТОХ
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения.Остатки(
	|			&Дата,
	|			(Номенклатура, СерияНоменклатуры) В
	|				(ВЫБРАТЬ
	|					Фильтр.Номенклатура,
	|					Фильтр.СерияНоменклатуры
	|				ИЗ
	|					ТаблТовары КАК Фильтр)) КАК ТоварыОтветственногоХраненияОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	//|	ТоварыОтветственногоХраненияОстатки.Организация,
	|	ТоварыОтветственногоХраненияОстатки.Контрагент,
	|	ТоварыОтветственногоХраненияОстатки.ДоговорКонтрагента,
	|	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	|	ТоварыОтветственногоХраненияОстатки.СерияНоменклатуры,
	|	0,
	|	ТоварыОтветственногоХраненияОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(
	|			&Дата,
	|			(Номенклатура, СерияНоменклатуры) В
	|				(ВЫБРАТЬ
	|					Фильтр.Номенклатура,
	|					Фильтр.СерияНоменклатуры
	|				ИЗ
	|					ТаблТовары КАК Фильтр)) КАК ТоварыОтветственногоХраненияОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	ВТ_ОстаткиТОХ.Организация,
	|	ВТ_ОстаткиТОХ.Контрагент,
	|	ВТ_ОстаткиТОХ.ДоговорКонтрагента,
	|	ВТ_ОстаткиТОХ.Номенклатура,
	|	ВТ_ОстаткиТОХ.СерияНоменклатуры,  
	|	ВТ_ОстаткиТОХ.КоличествоОстатокТОХ КАК КоличествоОстатокТОХ,
	|	ВТ_ОстаткиТОХ.КоличествоОстатокТОХ - ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал КАК Остаток,
	|	ТОХОстаткиИОбороты.Период КАК Период
	|ИЗ
	|	ВТ_ОстаткиТОХ КАК ВТ_ОстаткиТОХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОтветственногоХранения.ОстаткиИОбороты(
	|				,
	|				&Дата,
	|				Регистратор,
	|				,
	|				(Номенклатура, СерияНоменклатуры) В
	|					(ВЫБРАТЬ
	|						Фильтр.Номенклатура,
	|						Фильтр.СерияНоменклатуры
	|					ИЗ
	|						ТаблТовары КАК Фильтр)) КАК ТОХОстаткиИОбороты
	|		ПО ВТ_ОстаткиТОХ.ДоговорКонтрагента = ТОХОстаткиИОбороты.ДоговорКонтрагента
	|			И ВТ_ОстаткиТОХ.Контрагент = ТОХОстаткиИОбороты.Контрагент
	|			И ВТ_ОстаткиТОХ.Номенклатура = ТОХОстаткиИОбороты.Номенклатура
	|			И ВТ_ОстаткиТОХ.СерияНоменклатуры = ТОХОстаткиИОбороты.СерияНоменклатуры
	//|			И ВТ_ОстаткиТОХ.Организация = ТОХОстаткиИОбороты.Организация
	|ГДЕ
	|	ВТ_ОстаткиТОХ.КоличествоОстатокТОХ - ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	//+Шульман А. 31.07.2024 #UT10-4640   
	//ЗапросОстатков.УстановитьПараметр("Товары", ДокОбъект.ТоварыОтветственногоХранения.Выгрузить()); 
	ЗапросОстатков.УстановитьПараметр("Товары", ?(ТабЧастьТОХ = Неопределено, ДокОбъект.ТоварыОтветственногоХранения.Выгрузить(), ТабЧастьТОХ)); 
	//-Шульман А. 31.07.2024 #UT10-4640   
	
	ЗапросОстатков.УстановитьПараметр("Дата", Новый Граница(ДокОбъект.Дата, ВидГраницы.Исключая));
	
	РезультатЗапросаОстатков = ЗапросОстатков.Выполнить();
	
	Если НЕ РезультатЗапросаОстатков.Пустой() Тогда		
		
		ТаблОстатков = РезультатЗапросаОстатков.Выгрузить();		
		
		Для Каждого СтрокаТаблДвижений Из ДокОбъект.ТоварыОтветственногоХранения Цикл
			
			КоличествоРаспределить = СтрокаТаблДвижений.Количество;
			СтрокиОстатков = ТаблОстатков.НайтиСтроки(Новый Структура("Номенклатура, СерияНоменклатуры", СтрокаТаблДвижений.Номенклатура, СтрокаТаблДвижений.СерияНоменклатуры));
			
			//+Шульман А. 15.08.2024 #UT10-4669   
			Остаток = 0;
			//+Пашкин О. 21.05.2025 #UT10-5188 
			//Остаток = СтрокиОстатков[0].Остаток;      
			Если СтрокиОстатков.Количество() > 0 Тогда
				Остаток = СтрокиОстатков[0].Остаток;      
			Иначе 
				Продолжить;
			КонецЕсли;
			//-Пашкин О. 21.05.2025 #UT10-5188 
			//-Шульман А. 15.08.2024 #UT10-4669   

			Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
				
				Если КоличествоРаспределить = 0 Тогда 
					Прервать;
				КонецЕсли;
				
				//+Шульман А. 15.08.2024 #UT10-4669   
				//НоваяСтрокаТаблДвижений = ПромТаблицаДвижений.Добавить();
				//ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблДвижений, СтрокаТаблДвижений);  
				
				//Списать = МИН(МАКС(0, СтрокаОстатка.Остаток), КоличествоРаспределить);
				Списать = МИН(МАКС(0, Остаток), КоличествоРаспределить);
				//-Шульман А. 15.08.2024 #UT10-4669   
				
				Если Списать > 0 Тогда
					
					НоваяСтрокаТаблДвижений = ПромТаблицаДвижений.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблДвижений, СтрокаТаблДвижений);  
					
					НоваяСтрокаТаблДвижений.Количество = Списать;
					КоличествоРаспределить = КоличествоРаспределить - Списать;
					
					НоваяСтрокаТаблДвижений.Контрагент = СтрокаОстатка.Контрагент;
					НоваяСтрокаТаблДвижений.ДоговорКонтрагента = СтрокаОстатка.ДоговорКонтрагента;
					
					//+Шульман А. 15.08.2024 #UT10-4669   
					Остаток = Остаток - Списать;
					//-Шульман А. 15.08.2024 #UT10-4669   
					
				КонецЕсли;
					
			КонецЦикла;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	ПромТаблицаДвижений.ЗаполнитьЗначения(ДокОбъект.Организация, "Организация");   
	
КонецПроцедуры
